In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series(['gabe',np.nan,'jimbo','carl',np.nan,1])

In [8]:
data.isnull()

0    False
1     True
2    False
3    False
4     True
5    False
dtype: bool

In [11]:
data.fillna('not available',inplace=True)

In [23]:
data[[1,4]] = np.nan

In [31]:
data.isnull().value_counts()

False    4
True     2
dtype: int64

In [34]:
data.dropna(inplace=True)

In [50]:
data= data.reset_index()

In [58]:
data = data.drop('index',axis=1)

In [66]:
values = [['jimmy','john']]

In [74]:
values = pd.DataFrame(values).T

In [76]:
new = pd.concat([data,values])

In [77]:
new

       0
0   gabe
1  jimbo
2   carl
3      1
0  jimmy
1   john

In [84]:
new = data.append(values).reset_index(drop=True)

In [112]:
series = pd.Series([1,2,3,4,45,5],
          index=['gabe','jeremy','marisa','kevin','marder','oreo'])

In [110]:
pd.DataFrame(series)

         0
gabe     1
jeremy   2
marisa   3
kevin    4
marder  45
oreo     5

In [113]:
data = pd.Series([1,np.nan,3.5,np.nan,7])

In [114]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [115]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [116]:
data.isnull().value_counts()

False    3
True     2
dtype: int64

In [127]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [130]:
data = pd.DataFrame([[1,6.5,3],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])

In [132]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [134]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [137]:
data.fillna('gabe')

      0     1     2
0     1   6.5     3
1     1  gabe  gabe
2  gabe  gabe  gabe
3  gabe   6.5     3

In [138]:
data.fillna({0:'gabe',1:'james'})

      0      1    2
0     1    6.5  3.0
1     1  james  NaN
2  gabe  james  NaN
3  gabe    6.5  3.0

In [140]:
data.fillna(method='ffill')

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0

In [141]:
### TAKING ONLY THE FIRST INSTANCE OF DUPES ###
###############################################

# Use the .shift function

data = pd.DataFrame({'k1':['one','two']*3 + ['two'],
                    'k2':[1,1,2,3,3,4,4]})

In [142]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [146]:
values = {'first_instance':[1,3,4]}

In [155]:
data[data['k2'].duplicated()]

    k1  k2
1  two   1
4  one   3
6  two   4

In [157]:
data['first_instance'] = data.k2.where(data.k2 != data.k2.shift(),'')

In [158]:
data

    k1  k2 first_instance
0  one   1              1
1  two   1
2  one   2              2
3  two   3              3
4  one   3
5  two   4              4
6  two   4

In [164]:
data['newest'] = data['k2'].where(data['k2'] != data['k2'].shift(),'dupe')

In [167]:
data.drop('newest',axis=1,inplace=True)

In [168]:
data

    k1  k2 first_instance
0  one   1              1
1  two   1
2  one   2              2
3  two   3              3
4  one   3
5  two   4              4
6  two   4

In [ ]:
### REMOVING DUPLICATES ###
###########################

In [170]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
             'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [171]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [172]:
meat = {'bacon':'pig',
       'pulled pork':'pig',
       'pastrami':'cow',
       'corned beef':'cow',
       'honey ham':'pig',
       'nova lox':'salmon'}

In [173]:
data['food'].map(meat) #problem here because, "Pastrami" in index 3 has a capital "P"

0       pig
1       pig
2       pig
3       NaN
4       cow
5       NaN
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [177]:
data['food'] = data['food'].str.lower()

In [180]:
data['animal'] = data['food'].map(meat)

In [181]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [185]:
### Replacing Values ###

data = pd.DataFrame({'k1':['one','two']*3 + ['two'],
                    'k2':[1,1,2,3,3,4,4]})

In [187]:
data.replace(3,np.nan)

    k1   k2
0  one  1.0
1  two  1.0
2  one  2.0
3  two  NaN
4  one  NaN
5  two  4.0
6  two  4.0